5) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/AreabrickConfigurator.php:180    [M] Foreach_

--- Original
+++ New
@@ @@
             $emitter->emitArgument($argument);
             $data = new ConfiguratorData($context);
             $data->setConfig($editableConfig);
-            foreach ($this->configurators as $configurator) {
+            foreach (array() as $configurator) {
                 if ($configurator->supportsEditable($editableName, $editableConfig)) {
                     $configurator->createEditables($emitter, $editableName, $data);
                 }

6) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/AreabrickConfigurator.php:182    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $data->setConfig($editableConfig);
             foreach ($this->configurators as $configurator) {
                 if ($configurator->supportsEditable($editableName, $editableConfig)) {
-                    $configurator->createEditables($emitter, $editableName, $data);
+                    
                 }
             }
             yield from $emitter->emit();

8) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/AreabrickConfigurator.php:193    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
          * @var IConfigurator $configurator
          */
         foreach ($this->configurators as $configurator) {
-            $configurator->postCreateEditables($areabrick, $areaBrickConfig, $emitter);
+            
         }
         yield from $emitter->emit();
     }
 }

9) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/AreabrickRenderer.php:82    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
             if ($renderArgument->getType() === 'collection') {
                 $tag = new \ArrayObject();
-                $this->processRenderArguments($info, new \ArrayIterator($renderArgument->getValue()), $tag, $referencesContainer, $referenceId);
+                
                 $tag = (array) $tag;
             } elseif ($renderArgument->getType() === 'editable') {
                 $tag = $this->renderArgument($info, $renderArgument, $referenceId);

10) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/AreabrickRenderer.php:89    [M] CastArray

--- Original
+++ New
@@ @@
             if ($renderArgument->getType() === 'collection') {
                 $tag = new \ArrayObject();
                 $this->processRenderArguments($info, new \ArrayIterator($renderArgument->getValue()), $tag, $referencesContainer, $referenceId);
-                $tag = (array) $tag;
+                $tag = $tag;
             } elseif ($renderArgument->getType() === 'editable') {
                 $tag = $this->renderArgument($info, $renderArgument, $referenceId);
             } elseif ($renderArgument->getType() === 'reference') {

12) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/AreabrickRenderer.php:110    [M] LogicalNot

--- Original
+++ New
@@ @@
     protected function renderArgument(Info $info, RenderArgument $renderArgument, string $nameOverride = '') : ?Tag
     {
         $config = $renderArgument->getValue();
-        if (!is_array($config) || !isset($config['type'])) {
+        if (is_array($config) || !isset($config['type'])) {
             return null;
         }
         if (!isset($config['options'])) {

13) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/Configurator/DatasourceConfigurator.php:21    [M] Foreach_

--- Original
+++ New
@@ @@
         $context = $data->getContext();
         $brickConfig = $this->resolveBrickconfig($config['areabricks'][$brickName]);
         $registry = new DatasourceRegistry();
-        foreach ($brickConfig['datasources'] as $id => $datasourceConfig) {
+        foreach (array() as $id => $datasourceConfig) {
             $dsId = $datasourceConfig['id'];
             $dataSource = $config['datasources'][$dsId];
             $dataCall = $registry->createMethodCall($dataSource['service_id'], $dataSource['method'], $dataSource['args']);

14) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/Configurator/DatasourceConfigurator.php:30    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $dsId = $datasourceConfig['id'];
             $dataSource = $config['datasources'][$dsId];
             $dataCall = $registry->createMethodCall($dataSource['service_id'], $dataSource['method'], $dataSource['args']);
-            $registry->add($id, function () use($context, $dataCall, $datasourceConfig) {
-                $input = [];
-                foreach ($datasourceConfig['args'] as $name => $value) {
-                    $input[$name] = $this->recurseExpression($value, $context->toArray());
-                }
-                return $dataCall($input);
-            });
+            
         }
         $data->getContext()->setDatasources($registry);
     }

19) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/Configurator/DatasourceConfigurator.php:144    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     protected function resolveConfig(array $config) : array
     {
         $or = new OptionsResolver();
-        $or->setDefaults(['datasources' => [], 'areabricks' => []]);
+        $or->setDefaults(['areabricks' => []]);
         $or->setDefined(array_keys($config));
         return $or->resolve($config);
     }
 }

20) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/Configurator/DatasourceConfigurator.php:144    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     protected function resolveConfig(array $config) : array
     {
         $or = new OptionsResolver();
-        $or->setDefaults(['datasources' => [], 'areabricks' => []]);
+        
         $or->setDefined(array_keys($config));
         return $or->resolve($config);
     }
 }

21) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/Configurator/DatasourceConfigurator.php:145    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $or = new OptionsResolver();
         $or->setDefaults(['datasources' => [], 'areabricks' => []]);
-        $or->setDefined(array_keys($config));
+        
         return $or->resolve($config);
     }
 }

1) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/Configurator/DatasourceConfigurator.php:34    [M] Foreach_

--- Original
+++ New
@@ @@
             $dataCall = $registry->createMethodCall($dataSource['service_id'], $dataSource['method'], $dataSource['args']);
             $registry->add($id, function () use($context, $dataCall, $datasourceConfig) {
                 $input = [];
-                foreach ($datasourceConfig['args'] as $name => $value) {
+                foreach (array() as $name => $value) {
                     $input[$name] = $this->recurseExpression($value, $context->toArray());
                 }
                 return $dataCall($input);

4) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/Configurator/DatasourceConfigurator.php:77    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $argument = $emitter->get($name);
         if (!$data->getContext()->getDatasources()) {
             $argument = new RenderArgument('null', $argument->getName());
-            $emitter->emitArgument($argument);
+            
             return;
         }
         $this->generateDatasources($emitter, $data);

14) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/Configurator/GroupConfigurator.php:89    [M] Continue_

--- Original
+++ New
@@ @@
                 continue;
             }
             if (!$emitter->has($name)) {
-                continue;
+                break;
             }
             $groupName = $config['group'];
             if (!isset($groupArguments[$groupName])) {
