29) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/DependencyInjection/Configuration.php:46    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $builder->scalarNode('class')->info('Use a predefined service instead of a newly created one.')->end();
         $builder->scalarNode('label')->info('Specify a label for the admin UI.')->end();
-        $builder->scalarNode('icon')->info('Specify an icon for the admin UI.')->end();
+        
         $builder->scalarNode('open')->info('Set HTML prepended to the brick\'s contents.')->defaultValue('')->end();
         $builder->scalarNode('close')->info('Set HTML appended to the brick\'s contents.')->defaultValue('')->end();
         $builder->booleanNode('use_edit')->info('Use a separate edit template.')->defaultValue(false)->end();

30) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/DependencyInjection/Configuration.php:50    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $builder->scalarNode('class')->info('Use a predefined service instead of a newly created one.')->end();
         $builder->scalarNode('label')->info('Specify a label for the admin UI.')->end();
         $builder->scalarNode('icon')->info('Specify an icon for the admin UI.')->end();
-        $builder->scalarNode('open')->info('Set HTML prepended to the brick\'s contents.')->defaultValue('')->end();
+        
         $builder->scalarNode('close')->info('Set HTML appended to the brick\'s contents.')->defaultValue('')->end();
         $builder->booleanNode('use_edit')->info('Use a separate edit template.')->defaultValue(false)->end();
     }

31) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/DependencyInjection/Configuration.php:55    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $builder->scalarNode('label')->info('Specify a label for the admin UI.')->end();
         $builder->scalarNode('icon')->info('Specify an icon for the admin UI.')->end();
         $builder->scalarNode('open')->info('Set HTML prepended to the brick\'s contents.')->defaultValue('')->end();
-        $builder->scalarNode('close')->info('Set HTML appended to the brick\'s contents.')->defaultValue('')->end();
+        
         $builder->booleanNode('use_edit')->info('Use a separate edit template.')->defaultValue(false)->end();
     }
     protected function addGroupsAreabrick(NodeBuilder $builder) : void

32) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/DependencyInjection/Configuration.php:60    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $builder->scalarNode('icon')->info('Specify an icon for the admin UI.')->end();
         $builder->scalarNode('open')->info('Set HTML prepended to the brick\'s contents.')->defaultValue('')->end();
         $builder->scalarNode('close')->info('Set HTML appended to the brick\'s contents.')->defaultValue('')->end();
-        $builder->booleanNode('use_edit')->info('Use a separate edit template.')->defaultValue(false)->end();
+        
     }
     protected function addGroupsAreabrick(NodeBuilder $builder) : void
     {

33) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/DependencyInjection/Configuration.php:63    [M] FalseValue

--- Original
+++ New
@@ @@
         $builder->scalarNode('icon')->info('Specify an icon for the admin UI.')->end();
         $builder->scalarNode('open')->info('Set HTML prepended to the brick\'s contents.')->defaultValue('')->end();
         $builder->scalarNode('close')->info('Set HTML appended to the brick\'s contents.')->defaultValue('')->end();
-        $builder->booleanNode('use_edit')->info('Use a separate edit template.')->defaultValue(false)->end();
+        $builder->booleanNode('use_edit')->info('Use a separate edit template.')->defaultValue(true)->end();
     }
     protected function addGroupsAreabrick(NodeBuilder $builder) : void
     {

34) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/DependencyInjection/Configuration.php:69    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     protected function addGroupsAreabrick(NodeBuilder $builder) : void
     {
-        $builder->variableNode('groups')->info('Define groups for areabrick.')->defaultValue([])->end();
+        
     }
     protected function addDatasourcesAreabrick(NodeBuilder $builder) : void
     {

37) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/DependencyInjection/Configuration.php:160    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     protected function addAreabrickSection(ArrayNodeDefinition $node) : void
     {
         $prototype = $node->children()->arrayNode('areabricks')->useAttributeAsKey('name')->arrayPrototype()->children();
-        $this->addCommonAreabrick($prototype);
+        
         $this->addGroupsAreabrick($prototype);
         $this->addDatasourcesAreabrick($prototype);
         $this->addEditableAreabrick($prototype);

38) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/DependencyInjection/Configuration.php:161    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $prototype = $node->children()->arrayNode('areabricks')->useAttributeAsKey('name')->arrayPrototype()->children();
         $this->addCommonAreabrick($prototype);
-        $this->addGroupsAreabrick($prototype);
+        
         $this->addDatasourcesAreabrick($prototype);
         $this->addEditableAreabrick($prototype);
         $prototype->end()->end()->end();

39) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/DependencyInjection/Configuration.php:162    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $prototype = $node->children()->arrayNode('areabricks')->useAttributeAsKey('name')->arrayPrototype()->children();
         $this->addCommonAreabrick($prototype);
         $this->addGroupsAreabrick($prototype);
-        $this->addDatasourcesAreabrick($prototype);
+        
         $this->addEditableAreabrick($prototype);
         $prototype->end()->end()->end();
     }

40) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/DependencyInjection/Configuration.php:163    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->addCommonAreabrick($prototype);
         $this->addGroupsAreabrick($prototype);
         $this->addDatasourcesAreabrick($prototype);
-        $this->addEditableAreabrick($prototype);
+        
         $prototype->end()->end()->end();
     }
     protected function addDatasourcesSection(ArrayNodeDefinition $node) : void

41) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/DependencyInjection/Configuration.php:165    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->addGroupsAreabrick($prototype);
         $this->addDatasourcesAreabrick($prototype);
         $this->addEditableAreabrick($prototype);
-        $prototype->end()->end()->end();
+        
     }
     protected function addDatasourcesSection(ArrayNodeDefinition $node) : void
     {

43) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/DependencyInjection/PimcoreRadBrickExtension.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function load(array $configs, ContainerBuilder $container)
     {
         $loader = new YamlFileLoader($container, new FileLocator(dirname(__DIR__) . '/Resources/config'));
-        $loader->load('services.yml');
+        
         $configuration = new Configuration();
         $config = $this->processConfiguration($configuration, $configs);
         $configurators = [];

44) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/DependencyInjection/PimcoreRadBrickExtension.php:31    [M] Foreach_

--- Original
+++ New
@@ @@
         $config = $this->processConfiguration($configuration, $configs);
         $configurators = [];
         $ids = $container->findTaggedServiceIds('radbrick.configurator');
-        foreach ($ids as $id => $tags) {
+        foreach (array() as $id => $tags) {
             $configurators[] = new Reference($id);
         }
         $datasources = $config['datasources'];

45) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/DependencyInjection/PimcoreRadBrickExtension.php:36    [M] Foreach_

--- Original
+++ New
@@ @@
             $configurators[] = new Reference($id);
         }
         $datasources = $config['datasources'];
-        foreach ($datasources as $key => $datasource) {
+        foreach (array() as $key => $datasource) {
             $datasources[$key]['service_id'] = new Reference($datasource['service_id']);
         }
         $config['datasources'] = $datasources;

46) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/DependencyInjection/PimcoreRadBrickExtension.php:42    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $datasources[$key]['service_id'] = new Reference($datasource['service_id']);
         }
         $config['datasources'] = $datasources;
-        $configurator = new Definition(AreabrickConfigurator::class, [$config, $configurators]);
+        $configurator = new Definition(AreabrickConfigurator::class, [$configurators]);
         $container->setDefinition(AreabrickConfigurator::class, $configurator);
         $areabricks = $config['areabricks'];
         foreach ($areabricks as $id => $aconfig) {

47) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/DependencyInjection/PimcoreRadBrickExtension.php:47    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         $config['datasources'] = $datasources;
         $configurator = new Definition(AreabrickConfigurator::class, [$config, $configurators]);
-        $container->setDefinition(AreabrickConfigurator::class, $configurator);
+        
         $areabricks = $config['areabricks'];
         foreach ($areabricks as $id => $aconfig) {
             $target = null;

48) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/DependencyInjection/PimcoreRadBrickExtension.php:50    [M] Foreach_

--- Original
+++ New
@@ @@
         $configurator = new Definition(AreabrickConfigurator::class, [$config, $configurators]);
         $container->setDefinition(AreabrickConfigurator::class, $configurator);
         $areabricks = $config['areabricks'];
-        foreach ($areabricks as $id => $aconfig) {
+        foreach (array() as $id => $aconfig) {
             $target = null;
             $definitionId = 'radbrick.' . $id;
             if ($class = $aconfig['class']) {

49) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/DependencyInjection/PimcoreRadBrickExtension.php:58    [M] LogicalNot

--- Original
+++ New
@@ @@
                 $definitionId = $class;
                 $target = $container->getDefinition($class);
             }
-            if (!$target) {
+            if ($target) {
                 $target = new Definition(SimpleBrick::class, [$id, new Reference('pimcore.templating.tag_renderer'), new Reference(AreabrickConfigurator::class)]);
             }
             if (!$target->hasTag('pimcore.area.brick')) {

50) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/DependencyInjection/PimcoreRadBrickExtension.php:60    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 $target = $container->getDefinition($class);
             }
             if (!$target) {
-                $target = new Definition(SimpleBrick::class, [$id, new Reference('pimcore.templating.tag_renderer'), new Reference(AreabrickConfigurator::class)]);
+                $target = new Definition(SimpleBrick::class, [new Reference('pimcore.templating.tag_renderer'), new Reference(AreabrickConfigurator::class)]);
             }
             if (!$target->hasTag('pimcore.area.brick')) {
                 $target->addTag('pimcore.area.brick', ['id' => $id]);

51) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/DependencyInjection/PimcoreRadBrickExtension.php:68    [M] LogicalNot

--- Original
+++ New
@@ @@
             if (!$target) {
                 $target = new Definition(SimpleBrick::class, [$id, new Reference('pimcore.templating.tag_renderer'), new Reference(AreabrickConfigurator::class)]);
             }
-            if (!$target->hasTag('pimcore.area.brick')) {
+            if ($target->hasTag('pimcore.area.brick')) {
                 $target->addTag('pimcore.area.brick', ['id' => $id]);
             }
             $container->setDefinition($definitionId, $target);

52) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/DependencyInjection/PimcoreRadBrickExtension.php:69    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 $target = new Definition(SimpleBrick::class, [$id, new Reference('pimcore.templating.tag_renderer'), new Reference(AreabrickConfigurator::class)]);
             }
             if (!$target->hasTag('pimcore.area.brick')) {
-                $target->addTag('pimcore.area.brick', ['id' => $id]);
+                $target->addTag('pimcore.area.brick', []);
             }
             $container->setDefinition($definitionId, $target);
         }
     }
 }

53) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/DependencyInjection/PimcoreRadBrickExtension.php:69    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $target = new Definition(SimpleBrick::class, [$id, new Reference('pimcore.templating.tag_renderer'), new Reference(AreabrickConfigurator::class)]);
             }
             if (!$target->hasTag('pimcore.area.brick')) {
-                $target->addTag('pimcore.area.brick', ['id' => $id]);
+                
             }
             $container->setDefinition($definitionId, $target);
         }
     }
 }

54) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/DependencyInjection/PimcoreRadBrickExtension.php:72    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             if (!$target->hasTag('pimcore.area.brick')) {
                 $target->addTag('pimcore.area.brick', ['id' => $id]);
             }
-            $container->setDefinition($definitionId, $target);
+            
         }
     }
 }

55) /home/farty/src/khusseini/PimcoreRadBrickBundle/src/ExpressionLanguage/ExpressionWrapper.php:64    [M] Throw_

--- Original
+++ New
@@ @@
                 $context = $context->toArray();
             }
             if (!is_array($context)) {
-                throw new InvalidArgumentException(sprintf("Context for evaluation needs to be array or of type %s. %s given", Context::class, gettype($context)));
+                new InvalidArgumentException(sprintf("Context for evaluation needs to be array or of type %s. %s given", Context::class, gettype($context)));
             }
         }
         foreach ($attributes as $attributePath) {
